{
  "text": "We have considerably simplified the way Coach Jack works with regards to hours and minutes. It will make it much easier to get exactly what you want and makes the whole process seem or look easier. So instead of dealing with weekly hours or anything else, what we've done is just put a daily range. So it's optimum to have that daily range start, you know, from a lower number where you're kind of currently at and go to a higher number. Now some days you may have fixed time available so you can't do that, but overall you want your plan to increase in duration from the beginning of the four weeks or the beginning of the plan to, in this case, the 12th week. So you can see here I can set the start hours, I can set the end hours, and it has a recommended, and I can do that for every day. And then your plan will, like you see up here, it will gradually increase. Then you have a rest day. So the hours will slowly increase over time, which is the best way to cause adaptions in the sense that you don't want to just increase TSS for adaptions. You want to, you know, focus more on hours if you can.",
  "segments": [
    {
      "start": 0.0,
      "end": 8.479999542236328,
      "text": " We have considerably simplified the way Coach Jack works with regards to hours"
    },
    {
      "start": 8.479999542236328,
      "end": 14.399999618530273,
      "text": " and minutes. It will make it much easier to get exactly what you want and makes the"
    },
    {
      "start": 14.399999618530273,
      "end": 21.559999465942383,
      "text": " whole process seem or look easier. So instead of dealing with weekly hours or"
    },
    {
      "start": 21.559999465942383,
      "end": 27.920000076293945,
      "text": " anything else, what we've done is just put a daily range. So it's optimum to"
    },
    {
      "start": 27.920000076293945,
      "end": 32.79999923706055,
      "text": " have that daily range start, you know, from a lower number where you're kind of"
    },
    {
      "start": 32.79999923706055,
      "end": 38.0,
      "text": " currently at and go to a higher number. Now some days you may have fixed time"
    },
    {
      "start": 38.0,
      "end": 43.91999816894531,
      "text": " available so you can't do that, but overall you want your plan to increase"
    },
    {
      "start": 43.91999816894531,
      "end": 51.040000915527344,
      "text": " in duration from the beginning of the four weeks or the beginning of the plan"
    },
    {
      "start": 51.040000915527344,
      "end": 57.68000030517578,
      "text": " to, in this case, the 12th week. So you can see here I can set the start hours, I"
    },
    {
      "start": 57.68000030517578,
      "end": 65.72000122070312,
      "text": " can set the end hours, and it has a recommended, and I can do that for every"
    },
    {
      "start": 65.72000122070312,
      "end": 72.19999694824219,
      "text": " day. And then your plan will, like you see up here, it will gradually increase. Then"
    },
    {
      "start": 72.19999694824219,
      "end": 76.80000305175781,
      "text": " you have a rest day. So the hours will slowly increase over time, which is the"
    },
    {
      "start": 76.80000305175781,
      "end": 83.72000122070312,
      "text": " best way to cause adaptions in the sense that you don't want to just"
    },
    {
      "start": 83.72000122070312,
      "end": 92.91999816894531,
      "text": " increase TSS for adaptions. You want to, you know, focus more on hours if you can."
    }
  ]
}